requestBody.xml

<?xml version="1.0" encoding="utf-8" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><HotelMediaLinksReq TargetBranch="P7005797" xmlns="http://www.travelport.com/schema/hotel_v21_0"><BillingPointOfSaleInfo OriginApplication="UAPI" xmlns="http://www.travelport.com/schema/common_v19_0"></BillingPointOfSaleInfo><HotelProperty HotelChain="RG" HotelCode="10506"></HotelProperty><HotelProperty HotelChain="IC" HotelCode="19246"></HotelProperty><HotelProperty HotelChain="HI" HotelCode="49203"></HotelProperty><HotelProperty HotelChain="HI" HotelCode="31059"></HotelProperty><HotelProperty HotelChain="HI" HotelCode="93189"></HotelProperty><HotelProperty HotelChain="SI" HotelCode="26229"></HotelProperty><HotelProperty HotelChain="HL" HotelCode="4963"></HotelProperty><HotelProperty HotelChain="LW" HotelCode="26039"></HotelProperty><HotelProperty HotelChain="HY" HotelCode="9992"></HotelProperty><HotelProperty HotelChain="MP" HotelCode="17862"></HotelProperty><HotelProperty HotelChain="SI" HotelCode="58047"></HotelProperty><HotelProperty HotelChain="WV" HotelCode="85683"></HotelProperty></HotelMediaLinksReq></s:Body></s:Envelope>